# ***Water Analysis***

> importing modules

In [1]:
import numpy as np
import pandas as pd

> imporing data from excell sheet

In [2]:
data = pd.read_excel("GWQ_2010-2018.xlsx",sheet_name="Sheet1")

### Basic data analysis

In [3]:
data.head()

,SITE_ID,WRIS ID,LATITUDE,LONGITUDE,SITE_TYPE,STATE_NAME,DISTRICT_NAME,TAHSIL_NAME,BLOCK_NAME,SITE_NAME,...,FLUORIDE,SAR,RSC,SiO2,PO4,TDS,Turbidity,%Na,Arsenic,LR. No
0,W115159092441001,W23881,11.866389,92.736111,Dug Well,Andaman And Nicobar,A & N Islands,Ferrargunj,South Andaman,Shoal Bay– 15 No.,...,0.37,NaN,NaN,13.97,NaN,217.748,NaN,NaN,NaN,NaN
1,New,W38814,12.186944,92.791667,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Baratang Island,South Creek (Sundergarh),...,0.24,0,0,15.14,0,360.745,,,0,0
2,W123014092513301,W24095,12.503889,92.859167,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Bakultala,...,0.96,0,0,7.67,0,239.246,NaN,NaN,0,NaN
3,W123129092581301,W24112,12.524722,92.970278,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Nimbutala,...,1.02,0,0,0,0,253.22,NaN,NaN,0,NaN
4,W123030092573801,W24098,12.508333,92.960556,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Padmanavapuram,...,0.74,0,0,10.34,0,185.361,NaN,NaN,0,NaN

In [4]:
data.count()

SITE_ID           85197
WRIS ID           85197
LATITUDE          84916
LONGITUDE         84916
SITE_TYPE         85197
STATE_NAME        85197
DISTRICT_NAME     85196
TAHSIL_NAME       85085
BLOCK_NAME        85071
SITE_NAME         85197
BASIN_NAME        85197
PROJECT_NAME      85197
year              85197
PH                85193
EC                85194
TH                81780
TOT_ALKALINITY    68788
CA                82060
MG                82049
NA                82056
K                 81988
FE                68575
CARBONATE         79104
BICARBONATE       81973
CHLORIDE          85185
SULPHATE          82060
NITRATE           81056
FLUORIDE          83992
SAR               69351
RSC               67521
SiO2              21338
PO4               22929
TDS               21477
Turbidity          3409
%Na                4025
Arsenic           15535
LR. No            10911
dtype: int64

In [5]:
data.describe()

               year
count  85197.000000
mean    2014.493738
std        2.551327
min     2010.000000
25%     2012.000000
50%     2015.000000
75%     2017.000000
max     2018.000000

In [6]:
data.head()

,SITE_ID,WRIS ID,LATITUDE,LONGITUDE,SITE_TYPE,STATE_NAME,DISTRICT_NAME,TAHSIL_NAME,BLOCK_NAME,SITE_NAME,...,FLUORIDE,SAR,RSC,SiO2,PO4,TDS,Turbidity,%Na,Arsenic,LR. No
0,W115159092441001,W23881,11.866389,92.736111,Dug Well,Andaman And Nicobar,A & N Islands,Ferrargunj,South Andaman,Shoal Bay– 15 No.,...,0.37,NaN,NaN,13.97,NaN,217.748,NaN,NaN,NaN,NaN
1,New,W38814,12.186944,92.791667,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Baratang Island,South Creek (Sundergarh),...,0.24,0,0,15.14,0,360.745,,,0,0
2,W123014092513301,W24095,12.503889,92.859167,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Bakultala,...,0.96,0,0,7.67,0,239.246,NaN,NaN,0,NaN
3,W123129092581301,W24112,12.524722,92.970278,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Nimbutala,...,1.02,0,0,0,0,253.22,NaN,NaN,0,NaN
4,W123030092573801,W24098,12.508333,92.960556,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Padmanavapuram,...,0.74,0,0,10.34,0,185.361,NaN,NaN,0,NaN

In [7]:
neww_data = data.filter(['PH','EC','TH','TOT_ALKALINITY','FLUORIDE'], axis=1)

In [8]:
neww_data

         PH     EC   TH TOT_ALKALINITY FLUORIDE
0      8.34    355  130            160     0.37
1      8.46    596  120            205     0.24
2      8.11    394  160            155     0.96
3      7.89    448  200            200     1.02
4      8.01    309  125            130     0.74
...     ...    ...  ...            ...      ...
85192  7.83  118.1   60             60        0
85193   7.8    494  125             65     0.05
85194  7.85  480.9  200             55     0.38
85195  8.05  39.46   20             20        0
85196  7.71    530  175            130     0.34

[85197 rows x 5 columns]

# ***Now we have new dataset***

### **Now we will save it and do further analysis with it**

In [9]:
# we will comment it so that it creates ones
# neww_data.to_excel('new_data.xlsx',sheet_name='Sheet1')

In [10]:
new_data = pd.read_excel("new_data.xlsx",sheet_name="Sheet1")
new_data.count()

PH                83676
EC                84842
TH                76262
TOT_ALKALINITY    53287
FLUORIDE          79563
dtype: int64

In [11]:
new_data.head()

     PH   EC   TH  TOT_ALKALINITY FLUORIDE
0  8.34  355  130           160.0     0.37
1  8.46  596  120           205.0     0.24
2  8.11  394  160           155.0     0.96
3  7.89  448  200           200.0     1.02
4  8.01  309  125           130.0     0.74

In [12]:
new_data.describe()

       TOT_ALKALINITY
count    53287.000000
mean       215.322566
std        173.485726
min          0.000000
25%        100.000000
50%        190.160000
75%        300.000000
max       7909.840000

In [13]:
new_data.shape

(85197, 5)

> Now we will drop rows where any cell is Na

In [14]:
# new_data = new_data.dropna(subset=["FLUORIDE"])
new_data = new_data.dropna(axis=0)

In [15]:
new_data.shape

(50088, 5)

In [16]:
new_data['PH'].isna().sum()

0

In [17]:
new_data['EC'].isna().sum()

0

In [18]:
new_data['TH'].isna().sum()

0

In [19]:

new_data['TOT_ALKALINITY'].isna().sum()

0

In [20]:
new_data['FLUORIDE'].isna().sum()

0

In [21]:
new_data.count()

PH                50088
EC                50088
TH                50088
TOT_ALKALINITY    50088
FLUORIDE          50088
dtype: int64

# ***Now our data is ready to go further***

In [22]:
# neww_data.to_excel("a.xlsx",sheet_name='Sheet1')

In [23]:
new_data = new_data.astype(float)

In [24]:
correlation_matrix = new_data.corr()

In [25]:
correlation_matrix

                      PH        EC        TH  TOT_ALKALINITY  FLUORIDE
PH              1.000000 -0.000904 -0.001070       -0.003723  0.000924
EC             -0.000904  1.000000  0.807535        0.382506  0.177941
TH             -0.001070  0.807535  1.000000        0.247336  0.069550
TOT_ALKALINITY -0.003723  0.382506  0.247336        1.000000  0.234856
FLUORIDE        0.000924  0.177941  0.069550        0.234856  1.000000

In [26]:
correlation_matrix['FLUORIDE']

PH                0.000924
EC                0.177941
TH                0.069550
TOT_ALKALINITY    0.234856
FLUORIDE          1.000000
Name: FLUORIDE, dtype: float64

In [27]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50088 entries, 0 to 85196
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PH              50088 non-null  float64
 1   EC              50088 non-null  float64
 2   TH              50088 non-null  float64
 3   TOT_ALKALINITY  50088 non-null  float64
 4   FLUORIDE        50088 non-null  float64
dtypes: float64(5)
memory usage: 2.3 MB

# Finding correlation between flurine, sodium , carbonate , bicarbonate

In [28]:
new_data_2 = data.filter(['CARBONATE','BICARBONATE','CHLORIDE','SULPHATE','FLUORIDE'], axis=1)

In [29]:
new_data_2

      CARBONATE BICARBONATE CHLORIDE SULPHATE FLUORIDE
0            12       170.8   17.725     3.21     0.37
1            18       213.5   38.995    46.22     0.24
2             0       189.1   17.725    30.46     0.96
3             0         244   17.725    13.34     1.02
4             0       158.6    14.18    13.37     0.74
...         ...         ...      ...      ...      ...
85192         0        73.2   10.665        0        0
85193         0        79.3    85.32       27     0.05
85194         0        67.1    78.21       97     0.38
85195         0        24.4     7.11        0        0
85196         0       158.6    85.32       16     0.34

[85197 rows x 5 columns]

In [30]:
# new_data_2.to_excel('CBSClFl.xlsx',sheet_name='Sheet1')

In [54]:
car_bicar_data = pd.read_excel("CBSClFl.xlsx",sheet_name="Sheet1")

In [57]:
car_bicar_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85197 entries, 0 to 85196
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CARBONATE    62599 non-null  float64
 1   BICARBONATE  73668 non-null  float64
 2   CHLORIDE     81552 non-null  float64
 3   SULPHATE     71321 non-null  float64
 4   FLUORIDE     79560 non-null  float64
dtypes: float64(5)
memory usage: 3.3 MB

In [59]:
correlation_matrix = car_bicar_data.corr()
correlation_matrix

             CARBONATE  BICARBONATE  CHLORIDE  SULPHATE  FLUORIDE
CARBONATE     1.000000    -0.015421  0.023876  0.084410  0.139810
BICARBONATE  -0.015421     1.000000  0.248974  0.211581  0.213584
CHLORIDE      0.023876     0.248974  1.000000  0.571526  0.117136
SULPHATE      0.084410     0.211581  0.571526  1.000000  0.151797
FLUORIDE      0.139810     0.213584  0.117136  0.151797  1.000000

In [60]:
car_bicar_data.count()

CARBONATE      62599
BICARBONATE    73668
CHLORIDE       81552
SULPHATE       71321
FLUORIDE       79560
dtype: int64

## After removing rows in which black cells are there

In [61]:
car_bicar_data = car_bicar_data.dropna(axis=0)
car_bicar_data.count()

CARBONATE      57669
BICARBONATE    57669
CHLORIDE       57669
SULPHATE       57669
FLUORIDE       57669
dtype: int64

In [62]:
correlation_matrix = car_bicar_data.corr()
correlation_matrix

             CARBONATE  BICARBONATE  CHLORIDE  SULPHATE  FLUORIDE
CARBONATE     1.000000    -0.011019  0.025762  0.084914  0.142992
BICARBONATE  -0.011019     1.000000  0.244760  0.204077  0.216626
CHLORIDE      0.025762     0.244760  1.000000  0.568706  0.125026
SULPHATE      0.084914     0.204077  0.568706  1.000000  0.156154
FLUORIDE      0.142992     0.216626  0.125026  0.156154  1.000000

In [63]:
# old correlation
#               CARBONATE	BICARBONATE	    CHLORIDE	SULPHATE	FLUORIDE
# CARBONATE	    1.000000	-0.015421	    0.023876	0.084410	0.139810
# BICARBONATE	-0.015421	1.000000	    0.248974	0.211581	0.213584
# CHLORIDE	    0.023876	0.248974	    1.000000	0.571526	0.117136
# SULPHATE	    0.084410	0.211581	    0.571526	1.000000	0.151797
# FLUORIDE	    0.139810	0.213584	    0.117136	0.151797	1.000000